{
    "years": [
        {
            "year": "1991",
            "events": [
                {
                    "title": "High Tide",
                    "description": "Jess’s ﬁrst one-person show at Oberlin College."
                }
            ]
        },
        {
            "year": "1996",
            "events": [
                {
                    "title": "Eat Out: A Lesbian Dinner Theatre Extravaganza",
                    "description": "An evening-length performance extravaganza and four-course gourmet dinner featuring larger-than-life puppets and a live cunt-eating contest for dessert at the WOW Café Theater, New York City."
                }
            ]
        },
        {
            "year": "1997",
            "events": [
                {
                    "title": "The Lesbian Afterlife Carnival Extravaganza",
                    "description": "More than a dozen queer performers explore lesbian desire from the ‘Other Side’, envisioning alternate realities as a necessary part of initiating social change and mobilizing collectively. Performed at the WOW Café Theater."
                }
            ]
        },
        {
            "year": "1998",
            "events": [
                {
                    "title": "Utopia Roaming",
                    "description": "Performances and workshops touring to universities, theatres, and community centres in the US and Canada (1998–2001) that explore issues of lesbian identity and community, and encourage audiences to name their dreams and desires as a ﬁrst step towards realizing them. The initial tour, performed with Eric Cho and Jayne Weber, and supported by the Astraea Foundation and the Franklin Furnace Fund for Performance Art, travelled to sixteen cities in 1998."
                }
            ]
        },
        {
            "year": "2000",
            "events": [
                {
                    "title": "One Night Only",
                    "description": "An exploration of desire and fantasy in the sticky heat of a New York City summer. Performed with Vivian Babuts, Kelly Dolak, Dionne Herbert, Saira, Wazhmah Osman, and Christie White 28 July 2000 at Dixon Place."
                },
                {
                    "title": "The Mad Chef",
                    "description": "As The Mad Chef (2000–2003), the artist challenges the conﬁnes of role and identity, breaking through internal boundaries in discovery of uncharted territories. Live and video installments have been presented at numerous venues. At the Jack Tilton Gallery in New York, audiences are invited to paint with coloured cake frosting, replicating historical masterpieces and sugar-coating arranged still lives. Cakes become canvases, to be critiqued and then eaten."
                }
            ]
        },
        {
            "year": "2001",
            "events": [
                {
                    "title": "Talk to Me",
                    "description": "A performance satirizing the use of cell phones in public spaces and the inﬁltration of modern technology in urban culture. Toting a giant hot pink papier-mâché cell phone, Jess chatters, gossips, and rants her way through New York City. For one presentation at The Kitchen Street Festival, Jess performs as a representative of a ﬁctitious service provider, oﬀering satirical service contracts and cardboard phones."
                }
            ]
        },
        {
            "year": "2003",
            "events": [
                {
                    "title": "Attending",
                    "description": "Jess is stationed as a ‘full-service’ washroom attendant inside women’s public washrooms, on duty to attend to the needs of women using the facilities. Patrons can ring for service, which might include pussy wiping, tampon insertion, or provision of reading material. Additional services and supplies are oﬀered at the attendant’s cart including towels, lotions, hair products, and breath mints. Presented at Hysteria: A Festival of Women, Toronto; The Kitchen, New York City; Art Toronto (formerly known as The Toronto International Art Fair)."
                },
                {
                    "title": "Composite Body",
                    "description": "A modiﬁed dry-erase board is used in a process of creating a self-constructed body. The artist draws, erases, edits, and re-draws, moving through a spectrum of emotions as she considers the lines and contours of her imagined physique."
                },
                {
                    "title": "An Ontario Bride Seeks American Wives",
                    "description": "Soon after Jess moves from New York to Toronto, the province of Ontario legalizes same-sex marriage. In response to this historic legislation, Jess returns to New York to exercise her newly acquired rights, marrying countless people, pets, ﬁre hydrants, and street signs. She conducts more than 50 ceremonies, with accompanying vows, music, confetti, rings, and signed marriage certiﬁcates stating the terms of nuptials — including that, ‘if we bump into each other in a movie ticket line, and one of us is way up near the front of the line, we will allow the other person to sneak into the line right next to us, because that’s what married people do for each other’."
                },
                {
                    "title": "Silent Portrait Series",
                    "description": "A short silent ﬁlm of staged performance vignettes."
                },
                {
                    "title": "Six Degrees of Lesbian Nation",
                    "description": "A meditation on the inescapable web of lesbian community, this one-woman puppet work humor-ously maps our interconnected lives."
                },
                {
                    "title": "The Two Boobs",
                    "description": "With strings tied around nipples and faces painted on breasts, the two boobs become puppets, negotiating the complexities of their relationship in a silent movie-inspired puppet show."
                },
                {
                    "title": "From the Waist Up and Down",
                    "description": "One-hour of performance shenanigans at The Rhubarb Festival, Toronto. Curated by Naomi Campbell and performed with Samantha Blanchette, Laura Kim, Simla Civelek, Arun, and Scott White on piano."
                }
            ]
        },
        {
            "year": "2004",
            "events": [
                {
                    "title": "Marry Me",
                    "description": "An interactive web-based project where users can marry the artist, customize their own wedding vows, send e-card wedding announcements, and purchase presents for the bride from the artist’s online gift registry."
                },
                {
                    "title": "Restored",
                    "description": "Jess takes name-brand clothing from her closet and discreetly re-shelves it at stores of original purchase, inviting consumers to take the items home. Each item has a personalized tag that shares a story about the clothing’s signiﬁcance and the reason for letting it go. Restored was later presented in Montreal with a small team of artists donating and re-shelving clothes with customized tags. Tag design by Sandra Smith."
                },
                {
                    "title": "The Bookworm",
                    "description": "Subversive bookmarks are planted in books on the shelves at mega-bookstores, educating consumers about the troubling business practices of megastores and encouraging them to patronize independent booksellers. Four bookmarks were designed for this action, each one tailored for use in a particular kind of book. Bookmark design by Sandra Smith."
                },
                {
                    "title": "The Confessional",
                    "description": "The artist operates a confessional booth with audience participants during Hysteria: A Festival of Women at Buddies in Bad Times Theatre, Toronto. Curated by Festival Director Moynan King."
                },
                {
                    "title": "Emergency Exits",
                    "description": "Reﬂecting on her move from New York to Toronto, the artist oﬀers an autobiographical account of peculiar obsessions and geographical transitions in this hour-long scripted performance. Performed with Simla Civelek."
                }
            ]
        },
        {
            "year": "2023",
            "events": [
                {
                    "title": "For What It’s Worth",
                    "description": "Installation as part of the exhibition, Milk. Commissioned by Wellcome Collection, London, UK, and curated by Honor Beddard and Marianne Templeton."
                }
            ]
        }
    ]
}